Repository: KN-Emognition/heartauth-mobile
Catalog: lib/l10n/intl_*.arb
Languages: pl

# intropage1_title
source: Welcome to HAuth
pl: Witaj w HAuth

# intropage1_body
source: Secure Access, Powered by Your Heart.
pl: Bezpieczny dostęp, napędzany twoim sercem.

# intropage1_semantics
source: HAuth Logo
pl: Logo HAuth

# intropage2_title
source: How it works
pl: Jak to działa

# intropage2_body
source: Our app uses your unique ECG/PPG signals as a biometric marker. Instead of fingerprints or face scans, your heartbeat helps confirm your identity — safer and more convenient than traditional login methods.
pl: Nasza aplikacja wykorzystuje Twoje unikatowe sygnały EKG/PPG jako marker biometryczny. Zamiast odcisków palców lub skanów twarzy, Twoje tętno pomaga potwierdzić Twoją tożsamość — jest to bezpieczniejsze i wygodniejsze niż tradycyjne metody logowania.

# intropage2_semantics
source: Secure login with heartbeat signal
pl: Bezpieczne logowanie za pomocą sygnału serca

# intropage3_title
source: Getting started
pl: Pierwsze kroki

# intropage3_body
source: To setup, you’ll scan a QR code from the web portal to link this app to your account. We'll also need access to your wearable connected via Bluetooth, which we will use to collect your biometric signals.
pl: Aby skonfigurować, zeskanujesz kod QR z portalu internetowego, by połączyć tę aplikację z twoim kontem. Będziemy również potrzebować dostępu do urządzenia przenośnego podłączonego przez Bluetooth, które wykorzystamy do zbierania sygnałów biometrycznych.

# intropage3_semantics
source: Phone and wearable device connected via Bluetooth
pl: Telefon i urządzenie przenośne połączone przez Bluetooth

# intropage4_title
source: Complete the setup
pl: Proces konfiguracji

# intropage4_semantics
source: Phone icon with gear beside it signifying setup
pl: Ikona telefonu z kołem zębatym obok, oznaczająca ustawienia

# intropage4_step1
source: {step} Grant camera access
pl: {step} Przyznaj dostęp do aparatu

# intropage4_step2
source: {step} Connect Galaxy Watch device
pl: {step} Podłącz urządzenie Galaxy Watch

# intropage4_step3
source: {step} Install companion app on watch
pl: {step} Zainstaluj aplikację na zegarku

# intropage4_step4
source: {step} Grant notification access
pl: {step} Przyznaj dostęp do powiadomień

# intropage4_step5
source: {step} Begin pairing
pl: {step} Rozpocznij parowanie

# intropage4_galaxy_wearable_error
source: Failed to open Galaxy Wearable app!
pl: Nie udało się otworzyć aplikacji Galaxy Wearable!

# intropage4_app_page_error
source: Failed to open app page!
pl: Nie udało się otworzyć strony aplikacji!

# errorscreen_generic_error
source: An unknown error occurred.
pl: Wystąpił nieznany błąd.

# homescreen_button_text
source: Start measuring ECG
pl: Rozpocznij pomiar EKG

# homescreen_challenge_expired
source: Challenge has expired!
pl: Wyzwanie wygasło!

# homescreen_auth_challenge
source: Authentication Challenge
pl: Wyzwanie

# homescreen_no_challenge
source: No active challenge
pl: Brak aktywnego wyzwania

# homescreen_login_attempt
source: There's a new login attempt
pl: Nowa próba logowania

# homescreen_challenge_id
source: Challenge ID: {challengeId}
pl: ID próby: {challengeId}

# homescreen_challenge_fail
source: Failed to complete challenge
pl: Wyzwanie zakończone niepowodzeniem

# homescreen_challenge_success
source: Challenge completed successfully!
pl: Wyzwanie zakończone sukcesem!

# homescreen_no_login_attempts
source: Whoops! There seem to be no pending login attempts.
pl: Ups! Wygąda na to, że nie ma żadnych oczekujących prób logowania.

# homescreen_drawer_about
source: About
pl: O aplikacji

# homescreen_drawer_pair
source: Par another account
pl: Sparuj kolejne konto

# homescreen_drawer_language
source: Choose language
pl: Wybierz język

# pairingscreen_generic_device_name
source: My Device
pl: Moje urządzenie

# pairingscreen_pairing_confirmation
source: Are you sure you want to register this device?
pl: Czy na pewno chcesz zarejestrować to urządzenie?

# pairingscreen_device_display_name
source: Device display name:
pl: Przyjazna nazwa urządzenia:

# pairingscreen_register_button
source: Register
pl: Zarejestruj

# pairingscreen_cancel_button
source: Cancel
pl: Anuluj

# pairingscreen_generic_error
source: Unknown error
pl: Nieznany błąd

# pairingscreen_fail
source: Pairing failed: {error}
pl: Parowanie nieudane: {error}

# pairingscreen_qr_prompt
source: Please align the pairing code within the frame
pl: Proszę ustawić kod parowania w ramce

# aboutscreen_title
source: About HAuth
pl: O HAuth

# aboutscreen_subtitle
source: Authentication by ECG
pl: Autentykacja za pomocą sygnału EKG

# aboutscreen_desc1
source: HeartAuth is a biometric authentication system that uses the unique rhythm of the human heart as a key to verify identity.
pl: HeartAuth to system biometrycznego uwierzytelniania wykorzystujący unikalny rytm pracy serca jako klucz do potwierdzania tożsamości.

# aboutscreen_desc2
source: Instead of passwords or codes, the system analyzes an individual’s ECG signal, introducing a new way of logging in. HeartAuth seamlessly integrates with existing identity management systems such as Keycloak and requires no additional infrastructure.
pl: Zamiast haseł czy kodów system analizuje indywidualny sygnał EKG, tworząc nowy sposób logowania. HeartAuth bezproblemowo integruje się z istniejącymi systemami zarządzania tożsamością, takimi jak Keycloak, i nie wymaga dodatkowej infrastruktury.

# aboutscreen_desc3
source: Thanks to the OAuth2 standard, it enables easy integration with any applications and services. It’s a new era of digital security — your heart becomes your password.
pl: Dzięki standardowi OAuth2 umożliwia łatwą integrację z dowolnymi aplikacjami i usługami. To nowa era w cyfrowym bezpieczeństwie — Twoje serce staje się Twoim hasłem.

# aboutscreen_licenses_button
source: Open source licenses
pl: Licencje open source

# appcard_title
source: Secure your digital life
pl: Zabezpiecz swoje cyfrowe życie

# languagedialog_title
source: Select Language
pl: Wybierz język

# languagedialog_default
source: (Default)
pl: (Domyślny)

# stats_paired
source: Accounts paired
pl: Połącznone konta: {count}

# stats_challenges
source: Incoming challenges
pl: Przychodzące wyzwania: {count}

# stats_successful
source: Successful authentications
pl: Udane logowania: {count}

# server_unreachable_error
source: There was an error while trying to reach our servers. Please try again later.
pl: Wystąpił błąd podczas próby połączenia się z naszymi serwerami. Spróbuj ponownie później.

# unsupported_device
source: This ({brand}) device is not supported.
pl: Twoje urządzenie ({brand}) nie jest obsługiwane.
